cats99/app/controllers/cats_controller.rb

    def show
        @catherine = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def create
        @cat = Cat.new(cat_params)

        if @cat.save #if successfully saved
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
       @colors = Cat.catcolors
       @cat = Cat.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
      @cat = Cat.find_by(id: params[:id])

      if @cat.update_attributes(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "brown"], ["description", "          Charlie's cat is kinda ugly\r\n"], ["updated_at", "2022-05-31 07:05:32.512034"], ["id", 4]]