W7D5/RedditClone/app/controllers/application_controller.rb

    def current_user
        @current_user ||= User.find_by(session_token: session[:session_token]) # .where()
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "OEiBeCOpiETnNbmYE0wAKw"], ["LIMIT", 1]]