W7D5/RedditClone/app/models/user.rb

     def self.find_by_credential(username,password)
         user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "jomama"], ["LIMIT", 1]]

     def reset_session_token!
            self.session_token = SecureRandom::urlsafe_base64(16)
            self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "BsmudAQaO1UocssKgbQDEg"], ["updated_at", "2022-06-03 21:09:02.998391"], ["id", 3]]