W7D3/MusicApp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "dmKotHhRHmgxn50o9yUTSA"], ["updated_at", "2022-06-02 06:21:52.449056"], ["id", 3]]
---
    def reset_session_token!
       self.session_token = self.class.generate_session_token
       self.save!